In [ ]:
%load_ext sql

In [ ]:
%sql sqlite:///myfile.db

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sqlite3
conn = sqlite3.connect('myfile.db')
url = r'./stackexchange.csv'
stackoverflow = pd.read_csv(url)
stackoverflow.shape
# stackoverflow.to_sql("stackoverflow", conn, if_exists="replace",index=False)

45238

In [ ]:
%%sql
-- Select the count of the number of rows
SELECT count(*)
  FROM fortune500;

 * sqlite:///myfile.db
Done.

[(500,)]

In [ ]:
%%sql
-- Select the count of ticker, 
-- subtract from the total number of rows, 
-- and alias as missing
SELECT count(*) - count(ticker) AS missing, 
       count(*) AS total_rows,
        count(ticker) AS ticker_rows,
        count(profits_change) AS profile_change_rows,
        count(industry) AS industry_rows
  FROM fortune500;

 * sqlite:///myfile.db
Done.

[(32, 500, 468, 437, 487)]

In [ ]:
%%sql
SELECT company.name
FROM company
INNER JOIN fortune500
ON company.ticker = fortune500.ticker;

 * sqlite:///myfile.db
Done.

[('Apple Incorporated',),
 ('Amazon.com Inc',),
 ('Alphabet',),
 ('Microsoft Corp.',),
 ('International Business Machines Corporation',),
 ('PayPal Holdings Incorporated',),
 ('eBay, Inc.',),
 ('Adobe Systems Incorporated',)]

In [ ]:
%%sql

-- Count the number of tags with each type
SELECT type, count(*) AS count
  FROM tag_type
 -- To get the count for each type, what do you need to do?
 GROUP BY type
 -- Order the results with the most common
 -- tag types listed first
 ORDER BY count DESC;

 * sqlite:///myfile.db
Done.

[('cloud', 31),
 ('database', 6),
 ('payment', 5),
 ('mobile-os', 4),
 ('company', 4),
 ('api', 4),
 ('storage', 2),
 ('spreadsheet', 2),
 ('os', 2),
 ('identity', 1)]

In [ ]:
%%sql
-- Select the 3 columns desired
SELECT name, tag_type.tag, tag_type.type
  FROM company
  	   -- Join the tag_company and company tables
       INNER JOIN tag_company 
       ON company.id = tag_company.company_id
       -- Join the tag_type and company tables
       INNER JOIN tag_type
       ON tag_company.tag = tag_type.tag
  -- Filter to most common type
  WHERE type='cloud';

 * sqlite:///myfile.db
Done.

[('Amazon Web Services', 'amazon-cloudformation', 'cloud'),
 ('Amazon Web Services', 'amazon-cloudfront', 'cloud'),
 ('Amazon Web Services', 'amazon-cloudsearch', 'cloud'),
 ('Amazon Web Services', 'amazon-cloudwatch', 'cloud'),
 ('Amazon Web Services', 'amazon-cognito', 'cloud'),
 ('Amazon Web Services', 'amazon-data-pipeline', 'cloud'),
 ('Amazon Web Services', 'amazon-dynamodb', 'cloud'),
 ('Amazon Web Services', 'amazon-ebs', 'cloud'),
 ('Amazon Web Services', 'amazon-ec2', 'cloud'),
 ('Amazon Web Services', 'amazon-ecs', 'cloud'),
 ('Amazon Web Services', 'amazon-elastic-beanstalk', 'cloud'),
 ('Amazon Web Services', 'amazon-elasticache', 'cloud'),
 ('Amazon Web Services', 'amazon-elb', 'cloud'),
 ('Amazon Web Services', 'amazon-emr', 'cloud'),
 ('Amazon Web Services', 'amazon-glacier', 'cloud'),
 ('Amazon Web Services', 'amazon-kinesis', 'cloud'),
 ('Amazon Web Services', 'amazon-lambda', 'cloud'),
 ('Amazon Web Services', 'amazon-rds-aurora', 'cloud'),
 ('Amazon Web Services', 'amazon-rds', 'cloud'),
 ('Amazon Web Services', 'amazon-redshift', 'cloud'),
 ('Amazon Web Services', 'amazon-route53', 'cloud'),
 ('Amazon Web Services', 'amazon-s3', 'cloud'),
 ('Amazon Web Services', 'amazon-ses', 'cloud'),
 ('Amazon Web Services', 'amazon-simpledb', 'cloud'),
 ('Amazon Web Services', 'amazon-sns', 'cloud'),
 ('Amazon Web Services', 'amazon-sqs', 'cloud'),
 ('Amazon Web Services', 'amazon-swf', 'cloud'),
 ('Amazon Web Services', 'amazon-vpc', 'cloud'),
 ('Amazon Web Services', 'amazon-web-services', 'cloud'),
 ('Microsoft Corp.', 'azure', 'cloud'),
 ('Dropbox', 'dropbox', 'cloud')]

In [ ]:
%%sql
SELECT COALESCE(industry, sector, 'Unknown') AS industry2,
       COUNT(*) 
FROM fortune500 
GROUP BY industry2
ORDER BY COUNT(*) DESC
LIMIT 1;

 * sqlite:///myfile.db
Done.

[('Utilities: Gas and Electric', 22)]

In [ ]:
%%sql

SELECT company_original.name, title, rank
  -- Start with original company information
  FROM company AS company_original
       -- Join to another copy of company with parent
       -- company information
	   LEFT JOIN company AS company_parent
       ON company_original.parent_id = company_parent.id 
       -- Join to fortune500, only keep rows that match
       INNER JOIN fortune500 
       -- Use parent ticker if there is one, 
       -- otherwise original ticker
       ON coalesce(company_parent.ticker, 
                   company_original.ticker) = 
             fortune500.ticker
 -- For clarity, order by rank
 ORDER BY rank;

 * sqlite:///myfile.db
Done.

[('Apple Incorporated', 'Apple', 3),
 ('Amazon.com Inc', 'Amazon.com', 12),
 ('Amazon Web Services', 'Amazon.com', 12),
 ('Alphabet', 'Alphabet', 27),
 ('Google LLC', 'Alphabet', 27),
 ('Microsoft Corp.', 'Microsoft', 28),
 ('International Business Machines Corporation', 'IBM', 32),
 ('PayPal Holdings Incorporated', 'PayPal Holdings', 264),
 ('eBay, Inc.', 'eBay', 310),
 ('Adobe Systems Incorporated', 'Adobe Systems', 443)]

In [ ]:
%%sql
-- Select the original value
SELECT profits_change, 
	   -- Cast profits_change
CAST(profits_change AS integer) AS profits_change_int
  FROM fortune500 limit 5;

 * sqlite:///myfile.db
Done.

[(-7.2, -7), (0.0, 0), (-14.4, -14), (-51.5, -51), (53.0, 53)]

In [ ]:
%%sql
-- Divide 10 by 3
SELECT 10/3,
       -- Cast 10 as numeric and divide by 3
       10::numeric/3;

 * sqlite:///myfile.db
(sqlite3.OperationalError) unrecognized token: ":"
[SQL: -- Divide 10 by 3
SELECT 10/3,
       -- Cast 10 as numeric and divide by 3
       10::numeric/3;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql

SELECT '3.2'::numeric,
       '-123'::numeric,
       '1e3'::numeric,
       '1e-3'::numeric,
       '02314'::numeric,
       '0002'::numeric;

 * sqlite:///myfile.db
(sqlite3.OperationalError) unrecognized token: ":"
[SQL: SELECT '3.2'::numeric,
       '-123'::numeric,
       '1e3'::numeric,
       '1e-3'::numeric,
       '02314'::numeric,
       '0002'::numeric;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
-- Select the count of each value of revenues_change
SELECT revenues_change, count(*) 
  FROM fortune500
 GROUP BY revenues_change 
 -- order by the values of revenues_change
 ORDER BY revenues_change limit 3;

 * sqlite:///myfile.db
Done.

[(-57.5, 1), (-53.3, 1), (-51.4, 1)]

In [ ]:
%%sql
-- Select the count of each revenues_change integer value
SELECT revenues_change::integer, count(*) 
  FROM fortune500
 GROUP BY revenues_change::integer 
 -- order by the values of revenues_change
 ORDER BY revenues_change;

 * sqlite:///myfile.db
(sqlite3.OperationalError) unrecognized token: ":"
[SQL: -- Select the count of each revenues_change integer value
SELECT revenues_change::integer, count(*)
  FROM fortune500
 GROUP BY revenues_change::integer
 -- order by the values of revenues_change
 ORDER BY revenues_change;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
-- Count rows 
SELECT count(*)
  FROM fortune500
 -- Where...
 WHERE revenues_change > 0;

 * sqlite:///myfile.db
Done.

[(298,)]